import { Injectable } from '@nestjs/common';

@Injectable()
export class AppService {


  getHello(): string {
    return 'Hello World!';
  }

  getGift(id: number): string{

    switch(id){
      case 1: return "Ще бъде Коледа красива, годината за теб – щастлива! "
      case 2: return "Пътуване до тайнствена страна ще имаш през годината добра!"
      case 3: return 'Тук няма искаш и не щеш – в службата ще порастеш!'
      case 4: return 'Годината ще те омае, любов около теб витае!'
      case 5: return 'Таз година е щастлива, сила и здраве ще преливат!'
      case 6: return 'Държавна лотария, тото, на твоя страна е числото!'
      case 7: return 'Живота ти е сбъдната мечта. Ново жилище, нова кола!'
      case 8: return 'Годината ще те омае, любов около теб витае!'
      case 9: return 'Да си късметлия май ти е патент – таз година ти се пада нов апартамент.'
      case 10: return 'И тази година добър късмет улучи – пада ти се здраве и благополучие!'
      case 11: return 'Новата година нов късмет ти прати – В бизнеса постигаш завидни резултати!'
      case 12: return 'Пада ти се днес парата – няма вече до заплата да се чудиш и се маеш как да свържеш двата края...'
      case 13: return 'Досега мъдростта от тебе бяга, но сега най ще ти приляга!'
      case 14: return 'Здрав ще си като скала, с теб е силата сега!'
      case 15: return 'Ще се вихрят весели наздравици и хора - сватба ще има. Ура!'    
      default: return 'Ами сега? Май ни свършиха късметите :О'
    }
      

  }
}
